example = '123456789' # 1. В переменную example запишите любую строку

print(example[0])  # 2. Выведите на экран(в консоль) первый символ этой строки.

print(example[-1])  # 3. Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).

print(example[(len(example)) // 2:])  # 4. Выведите на экран(в консоль) вторую половину этой строки

print(example[::-1])    # 5. Выведите на экран(в консоль) это слово наоборот.

print(example[::2])    # 6. Выведите на экран(в консоль) каждый второй символ этой строки.

